#------------------------------------------------------------
#   coding:utf-8
#------------------------------------------------------------
#    Updata History
#    December  27  07:00, 2018 (Thu) by S.Iwamaru
#------------------------------------------------------------
#
#    ナイキスト線図
#
#------------------------------------------------------------
from control.matlab import *
import matplotlib.pyplot as plt

#  伝達関数のパラメータ
num = [2, 5, 1]    #  分子の係数
den = [1, 2, 3]    #  分母の係数
sys = tf(num, den) #  伝達関数モデルの作成
nyquist(sys)          #  ボード線図のプロット

plt.show()